"There was an error in processing the images." = "Se ha producido un error al procesar las imágenes.";

"The MakePDF application not found on this system." = "No se ha encontrado la aplicación MakePDF en este ordenador.";